describe('Post', () => {
  describe('게시글 생성 테스트', () => {
    it('게시글을 생성한다.', async () => {});

    it('게시글에 생성시 비밀번호를 해싱한다.', async () => {});
  });

  describe('게시글 수정 테스트', () => {
    it('비밀번호가 일치하면 게시글 수정에 성공한다.', async () => {});

    it('비밀번호가 일치하지 않으면 게시글 수정에 실패한다.', async () => {});
  });

  describe('게시글 삭제 테스트', () => {
    it('비밀번호가 일치하면 게시글 삭제에 성공한다.', async () => {});

    it('비밀번호가 일치하지 않으면 게시글 삭제에 실패한다.', async () => {});
  });

  describe('게시글에 댓글 추가 테스트', () => {
    it('게시글에 댓글을 추가한다.', async () => {});
  });
});
